jamesmunns/kinetis-rs/platform/drivers/sdhc/src/fsl_sdhc_driver.c
/*
 * Copyright (c) 2013 - 2014, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <assert.h>
#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include "fsl_os_abstraction.h"
#include "fsl_interrupt_manager.h"
#include "fsl_clock_manager.h"
#include "fsl_sdhc_hal.h"
#include "fsl_sdhc_common.h"
#include "fsl_sdhc_driver.h"
#include "sdhc.h"
#include "sdmmc.h"

static sdhc_host_t volatile *g_hosts[HW_SDHC_INSTANCE_COUNT] = {0};

/*FUNCTION****************************************************************
 *
 * Function Name: SDHC_DRV_SelectClock
 * Description: Select clock source for specific host controller
 *
 *END*********************************************************************/
static void SDHC_DRV_SelectClock(uint32_t instance)
{
    assert(instance < HW_SDHC_INSTANCE_COUNT);

    g_hosts[instance]->maxClock = CLOCK_SYS_GetSdhcFreq(instance);
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDHC_DRV_SetClock
 * Description: Enable clock for specific host controller
 *
 *END*********************************************************************/
static sdhc_status_t SDHC_DRV_SetClock(uint32_t instance, bool enable)
{
    assert(instance < HW_SDHC_INSTANCE_COUNT);
#if defined BSP_FSL_SDHC_CLKMGMT_ENABLED
    CLOCK_SYS_EnableEnetClock(instance);
#endif
    return kStatus_SDHC_NoError;
}

#if defined BSP_FSL_SDHC_ENABLE_ADMA1
/*FUNCTION****************************************************************
 *
 * Function Name: SDHC_DRV_FillAdma1Table
 * Description: Fill ADMA1 descriptor table, once its finish, the field
 *  of admaTableAddress is well configured. It will fail, if the incoming
 *  data does not align.
 *
 *END*********************************************************************/
static sdhc_status_t SDHC_DRV_FillAdma1Table(uint32_t instance, uint32_t *buffer, uint32_t length)
{
    uint32_t i = 0, entries;
    uint32_t *startAddress;
    sdhc_hal_adma1_descriptor_t *tableAddress = NULL;
    volatile sdhc_host_t *host;

    assert(instance < HW_SDHC_INSTANCE_COUNT);
    assert(buffer);
    assert(length);

    if (((uint32_t)buffer % SDHC_HAL_ADMA1_ADDR_ALIGN) ||
        (length % SDHC_HAL_ADMA1_ADDR_ALIGN))
    {
        return kStatus_SDHC_DataPrepareError;
    }

    host = g_hosts[instance];

    entries = (length / SDHC_HAL_ADMA1_DESC_MAX_LEN_PER_ENTRY) + 1;

    /* ADMA1 needs two descritors to finish a transfer */
    entries *= 2;
    if (entries > host->admaTableMaxEntries)
    {
        /* Larger table is needed */
        if (host->admaTableAddress)
        {
            OSA_MemFree(host->admaTableAddress);
            host->admaTableAddress = NULL;
            host->admaTableMaxEntries = 0;
        }
        tableAddress = (sdhc_hal_adma1_descriptor_t *)OSA_MemAllocZero(entries * sizeof(sdhc_hal_adma1_descriptor_t));
    }

    if ((tableAddress == NULL) && (host->admaTableAddress == NULL))
    {
        host->admaTableMaxEntries = 0;
        /* Failed to alloc memory for ADMA descriptor table */
        return kStatus_SDHC_DmaAddressError;
    }

    if (host->admaTableAddress == NULL)
    {
        /* Update ADMA table address */
        host->admaTableAddress = (uint32_t *)tableAddress;
        /* Update ADMA table capacity */
        host->admaTableMaxEntries = entries;
    }

    startAddress = buffer;
    for (i = 0; i < entries; i += 2)
    {
        /* Each descriptor for ADMA1 is 64-bit in length */
        if ((length - sizeof(uint32_t) * (startAddress - buffer)) < SDHC_HAL_ADMA1_DESC_MAX_LEN_PER_ENTRY)
        {
            /* The last piece of data, setting end flag in descriptor */
            host->admaTableAddress[i] = (uint32_t)(length - sizeof(uint32_t) * (startAddress - buffer)) << SDHC_HAL_ADMA1_DESC_LEN_SHIFT;
            host->admaTableAddress[i] |= SDHC_HAL_ADMA1_DESC_TYPE_SET;
            host->admaTableAddress[i+1] = (uint32_t)(startAddress) << SDHC_HAL_ADMA1_DESC_ADDRESS_SHIFT;
            host->admaTableAddress[i+1] |= SDHC_HAL_ADMA1_DESC_TYPE_TRAN | SDHC_HAL_ADMA1_DESC_END_MASK;
        }
        else
        {
            host->admaTableAddress[i] = (uint32_t)SDHC_HAL_ADMA1_DESC_MAX_LEN_PER_ENTRY << SDHC_HAL_ADMA1_DESC_LEN_SHIFT;
            host->admaTableAddress[i] |= SDHC_HAL_ADMA1_DESC_TYPE_SET;
            host->admaTableAddress[i+1] = (uint32_t)(startAddress) << SDHC_HAL_ADMA1_DESC_ADDRESS_SHIFT;
            host->admaTableAddress[i+1] |= SDHC_HAL_ADMA1_DESC_TYPE_TRAN;
            startAddress += SDHC_HAL_ADMA1_DESC_MAX_LEN_PER_ENTRY/sizeof(uint32_t);
        }
    }

    return kStatus_SDHC_NoError;
}
#endif

/*FUNCTION****************************************************************
 *
 * Function Name: SDHC_DRV_SetAdma2Descriptor
 * Description: Compose a ADMA2 descriptor, setting address/length and
 *   corresponding flags to be operated by the internal DMA engine.
 *
 *END*********************************************************************/
static void SDHC_DRV_SetAdma2Descriptor(uint32_t *table,
                                        uint32_t *buffer,
                                        uint32_t length,
                                        uint32_t flags)
{
    assert(table);
    assert(length <= SDHC_HAL_ADMA2_DESC_MAX_LEN_PER_ENTRY);

    ((sdhc_hal_adma2_descriptor_t *)table)->address = buffer;
    ((sdhc_hal_adma2_descriptor_t *)table)->attribute = ((SDHC_HAL_ADMA2_DESC_LEN_MASK & length) << SDHC_HAL_ADMA2_DESC_LEN_SHIFT) | flags;
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDHC_DRV_FillAdma2Table
 * Description: Fill ADMA2 descriptor table, once its finish, the field
 *   of admaTableAddress is well configured. It will fail, if the incoming
 *   data does not align.
 *
 *END*********************************************************************/
static sdhc_status_t SDHC_DRV_FillAdma2Table(uint32_t instance, uint32_t *buffer, uint32_t length)
{
    uint32_t i = 0, entries;
    uint32_t *startAddress;
    sdhc_hal_adma2_descriptor_t *tableAddress = NULL;
    volatile sdhc_host_t *host;

    assert(instance < HW_SDHC_INSTANCE_COUNT);
    assert(buffer);
    assert(length);

