jamesmunns/kinetis-rs/platform/drivers/sdhc/src/fsl_sdhc_driver.c
    if ((uint32_t)buffer % SDHC_HAL_ADMA2_ADDR_ALIGN)
    {
        return kStatus_SDHC_DataPrepareError;
    }

    host = g_hosts[instance];

    entries = ((length / SDHC_HAL_ADMA2_DESC_MAX_LEN_PER_ENTRY) + 1);
    if (entries > host->admaTableMaxEntries)
    {
        /* Larger table is needed */
        if (host->admaTableAddress)
        {
            OSA_MemFree(host->admaTableAddress);
            host->admaTableAddress = NULL;
            host->admaTableMaxEntries = 0;
        }
        tableAddress = (sdhc_hal_adma2_descriptor_t *)OSA_MemAllocZero(entries * sizeof(sdhc_hal_adma2_descriptor_t));
    }

    if ((tableAddress == NULL) && (host->admaTableAddress == NULL))
    {
        host->admaTableMaxEntries = 0;
        /* Failed to alloc memory for ADMA descriptor table */
        return kStatus_SDHC_DmaAddressError;
    }

    if (host->admaTableAddress == NULL)
    {
        /* Update ADMA table address */
        host->admaTableAddress = (uint32_t *)tableAddress;
        /* Update ADMA table capacity */
        host->admaTableMaxEntries = entries;
    }

    startAddress = buffer;
    for (i = 0; i < entries; i += 2)
    {
        /* Each descriptor for ADMA2 is 64-bit in length */
        if ((length - sizeof(uint32_t) * (startAddress - buffer)) < SDHC_HAL_ADMA2_DESC_MAX_LEN_PER_ENTRY)
        {
            /* The last piece of data, setting end flag in descriptor */
            SDHC_DRV_SetAdma2Descriptor(&host->admaTableAddress[i],
                    startAddress,
                    length - sizeof(uint32_t) * (startAddress - buffer),
                    SDHC_HAL_ADMA2_DESC_TYPE_TRAN | SDHC_HAL_ADMA2_DESC_END_MASK);
        }
        else
        {
            SDHC_DRV_SetAdma2Descriptor(&host->admaTableAddress[i],
                    startAddress,
                    SDHC_HAL_ADMA2_DESC_MAX_LEN_PER_ENTRY,
                    SDHC_HAL_ADMA2_DESC_TYPE_TRAN);
            startAddress += SDHC_HAL_ADMA2_DESC_MAX_LEN_PER_ENTRY/sizeof(uint32_t);
        }
    }
    return kStatus_SDHC_NoError;
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDHC_DRV_PrepareData
 * Description: Prepare data for transferring
 *
 *END*********************************************************************/
static sdhc_status_t SDHC_DRV_PrepareData(uint32_t instance,
                                          sdhc_request_t *req) 
{
    sdhc_status_t ret;
    uint32_t totalSize;
    volatile sdhc_host_t *host;

    assert(instance < HW_SDHC_INSTANCE_COUNT);
    assert(req);
    assert(req->data);
    assert(req->data->buffer);
    assert(req->data->blockCount);
    assert(req->data->blockSize);

    host = g_hosts[instance];
    ret = kStatus_SDHC_NoError;

    if ((host->mode != kSdhcTransModeAdma2)
#if defined BSP_FSL_SDHC_ENABLE_ADMA1
            && (host->mode != kSdhcTransModeAdma1)
#endif
            )
    {
        return ret;
    }

    totalSize = (req->data->blockSize * req->data->blockCount);
    if (((host->mode == kSdhcTransModeAdma2) &&
            (totalSize % SDHC_HAL_ADMA2_LEN_ALIGN)) ||
            ((host->mode == kSdhcTransModeAdma1) &&
             (totalSize % SDHC_HAL_ADMA1_LEN_ALIGN)))

    {
        return kStatus_SDHC_DataPrepareError;
    }

    SDHC_HAL_SetDmaAddress(g_sdhcBaseAddr[instance], 0);
    /* Check data length alignment */
    if ((host->mode == kSdhcTransModeAdma2))
    {
        /* ADMA2 */
        ret = SDHC_DRV_FillAdma2Table(instance, req->data->buffer, totalSize);
        if (ret != kStatus_SDHC_NoError)
        {
            return ret;
        }
    }
#if defined BSP_FSL_SDHC_ENABLE_ADMA1
    else
    {
        /* ADMA1 */
        ret = SDHC_DRV_FillAdma1Table(instance, req->data->buffer, totalSize);
        if (ret != kStatus_SDHC_NoError)
        {
            return ret;
        }
    }
#endif

    SDHC_HAL_SetAdmaAddress(g_sdhcBaseAddr[instance], (uint32_t)host->admaTableAddress);
    return ret;
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDHC_DRV_IsCardPresent
 * Description: Check whether card is inserted
 *
 *END*********************************************************************/
static bool SDHC_DRV_IsCardPresent(uint32_t instance)
{
    assert(instance < HW_SDHC_INSTANCE_COUNT);
    return SDHC_HAL_IsCardInserted(g_sdhcBaseAddr[instance]);
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDHC_DRV_ConfigClock
 * Description: configure clock of host controller, it will set the most
 *      close clock frequency to the given clock
 *
 *END*********************************************************************/
sdhc_status_t SDHC_DRV_ConfigClock(uint32_t instance, uint32_t clock)
{
    uint32_t divisor = SDHC_HAL_INITIAL_DVS, freq = SDHC_HAL_INITIAL_CLKFS;
    volatile sdhc_host_t *host = g_hosts[instance];

    SDHC_HAL_SetIpgClock(g_sdhcBaseAddr[instance], false);
    SDHC_HAL_SetSysClock(g_sdhcBaseAddr[instance], false);
    SDHC_HAL_SetPeripheralClock(g_sdhcBaseAddr[instance], false);
    SDHC_HAL_SetSdClock(g_sdhcBaseAddr[instance], false);

    if (clock > 0)
    {
        while((host->maxClock / freq / SDHC_HAL_MAX_DVS > clock) &&
                (freq < SDHC_HAL_MAX_CLKFS))
        {
            SDHC_HAL_NEXT_CLKFS(freq);
        }
        while((host->maxClock / freq / divisor > clock) &&
                (divisor < SDHC_HAL_MAX_DVS))
        {
            SDHC_HAL_NEXT_DVS(divisor);
        }

        clock = host->maxClock / freq / divisor;
        SDHC_HAL_PREV_CLKFS(freq);
        SDHC_HAL_PREV_DVS(divisor);

        SDHC_HAL_SetClockDivisor(g_sdhcBaseAddr[instance], divisor);
        SDHC_HAL_SetClockFrequency(g_sdhcBaseAddr[instance], freq);
        SDHC_HAL_SetDataTimeout(g_sdhcBaseAddr[instance], 0xE);

        SDHC_HAL_SetIpgClock(g_sdhcBaseAddr[instance], true);
        SDHC_HAL_SetSysClock(g_sdhcBaseAddr[instance], true);
        SDHC_HAL_SetPeripheralClock(g_sdhcBaseAddr[instance], true);

        while(!SDHC_HAL_IsSdClockStable(g_sdhcBaseAddr[instance])) {}
        SDHC_HAL_SetSdClock(g_sdhcBaseAddr[instance], true);
    }

    host->clock = clock;
    return kStatus_SDHC_NoError;
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDHC_DRV_SetBusWidth
 * Description: Configure bus width of host controller
 *
 *END*********************************************************************/
sdhc_status_t SDHC_DRV_SetBusWidth(uint32_t instance, sdhc_buswidth_t busWidth)
{
    assert(instance < HW_SDHC_INSTANCE_COUNT);
    sdhc_hal_dtw_t dtw = kSdhcHalDtw1Bit;
    volatile sdhc_host_t *host = g_hosts[instance];

    switch(busWidth)
    {
        case kSdhcBusWidth1Bit:
            dtw = kSdhcHalDtw1Bit;
            break;
        case kSdhcBusWidth4Bit:
            dtw = kSdhcHalDtw4Bit;
            break;
        default:
            return kStatus_SDHC_InvalidParameter;
    }
    SDHC_HAL_SetDataTransferWidth(g_sdhcBaseAddr[instance], dtw);
    host->busWidth = busWidth;
    return kStatus_SDHC_NoError;
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDHC_DRV_Reset
 * Description: Reset host controller accord to the given mask
 *
 *END*********************************************************************/
static sdhc_status_t SDHC_DRV_Reset(uint32_t instance, uint32_t mask)
{
    uint32_t timeout;
    volatile sdhc_host_t *host;
    assert(instance < HW_SDHC_INSTANCE_COUNT);

    timeout = 100;
    host = g_hosts[instance];

