jamesmunns/kinetis-rs/platform/drivers/sdhc/src/fsl_sdhc_driver.c
    if (!(mask & (SDHC_RESET_ALL | SDHC_RESET_DATA | SDHC_RESET_CMD)))
    {
        return kStatus_SDHC_InvalidParameter;
    }

    if (mask & SDHC_RESET_ALL)
    {
        host->clock = 0;
        SDHC_HAL_Reset(g_sdhcBaseAddr[instance], SDHC_HAL_RST_TYPE_ALL, timeout);
    }
    else if (mask == (SDHC_RESET_DATA | SDHC_RESET_CMD))
    {
        SDHC_HAL_Reset(g_sdhcBaseAddr[instance], (SDHC_HAL_RST_TYPE_DATA
                                | SDHC_HAL_RST_TYPE_CMD), timeout);
    }
    else if (mask == SDHC_RESET_CMD)
    {
        SDHC_HAL_Reset(g_sdhcBaseAddr[instance], SDHC_HAL_RST_TYPE_CMD, timeout);
    }
    else if (mask == SDHC_RESET_DATA)
    {
        SDHC_HAL_Reset(g_sdhcBaseAddr[instance], SDHC_HAL_RST_TYPE_DATA, timeout);
    }
    return kStatus_SDHC_NoError;
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDHC_DRV_GetMaxBlockSize
 * Description: Get max block size supported for the host controller
 *
 *END*********************************************************************/
static uint32_t SDHC_DRV_GetMaxBlockSize(uint32_t instance)
{
    uint32_t mbl, ret = 0;

    mbl = SDHC_HAL_GetMaxBlockLength(g_sdhcBaseAddr[instance]);
    switch (mbl)
    {
        case SDHC_HAL_MAX_BLKLEN_512B:
            ret = 512;
            break;
        case SDHC_HAL_MAX_BLKLEN_1024B:
            ret = 1024;
            break;
        case SDHC_HAL_MAX_BLKLEN_2048B:
            ret = 2048;
            break;
        case SDHC_HAL_MAX_BLKLEN_4096B:
            ret = 4096;
            break;
        default:
            break;
    }
    return ret;
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDHC_DRV_SendCommand
 * Description: Send command to card
 *
 *END*********************************************************************/
static sdhc_status_t SDHC_DRV_SendCommand(uint32_t instance,
                                          sdhc_request_t *req)
{
    uint32_t flags = 0;
    sdhc_status_t ret = kStatus_SDHC_NoError;
    assert(instance < HW_SDHC_INSTANCE_COUNT);
    assert(req);

    if (req->data)
    {
        flags |= SDHC_HAL_DATA_PRESENT;

        SDHC_HAL_SetIntState(g_sdhcBaseAddr[instance], false,
                (SDHC_HAL_DMA_ERR_INT | SDHC_HAL_DMA_INT |
                    SDHC_HAL_BUF_READ_READY_INT | SDHC_HAL_BUF_WRITE_READY_INT));
        SDHC_HAL_SetIntSignal(g_sdhcBaseAddr[instance], false,
                (SDHC_HAL_DMA_ERR_INT | SDHC_HAL_DMA_INT |
                    SDHC_HAL_BUF_READ_READY_INT | SDHC_HAL_BUF_WRITE_READY_INT));

        if (req->flags & FSL_SDHC_REQ_FLAGS_USE_DMA)
        {
            flags |= SDHC_HAL_ENABLE_DMA;
            SDHC_HAL_SetIntState(g_sdhcBaseAddr[instance], true,
                    (SDHC_HAL_DMA_ERR_INT | SDHC_HAL_DMA_INT));
            SDHC_HAL_SetIntSignal(g_sdhcBaseAddr[instance], true,
                    (SDHC_HAL_DMA_ERR_INT | SDHC_HAL_DMA_INT));
        }
        else
        {
            SDHC_HAL_SetIntState(g_sdhcBaseAddr[instance], true,
                    (SDHC_HAL_BUF_READ_READY_INT | SDHC_HAL_BUF_WRITE_READY_INT));
            SDHC_HAL_SetIntSignal(g_sdhcBaseAddr[instance], true,
                    (SDHC_HAL_BUF_READ_READY_INT | SDHC_HAL_BUF_WRITE_READY_INT));
        }

        if (req->flags & FSL_SDHC_REQ_FLAGS_DATA_READ)
        {
            flags |= SDHC_HAL_ENABLE_DATA_READ;
        }
    }

    if (g_req_resp_flags[req->respType] & FSL_SDHC_REQ_RSPTYPE_136BITS)
    {
        flags |= SDHC_HAL_RESP_LEN_136;
    }
    else if (g_req_resp_flags[req->respType] & FSL_SDHC_REQ_RSPTYPE_BUSY)
    {
        flags |= SDHC_HAL_RESP_LEN_48_BC;
    }
    else if (g_req_resp_flags[req->respType] & FSL_SDHC_REQ_RSPTYPE_PRESENT)
    {
        flags |= SDHC_HAL_RESP_LEN_48;
    }

    if (g_req_resp_flags[req->respType] & FSL_SDHC_REQ_RSPTYPE_CRC)
    {
        flags |= SDHC_HAL_ENABLE_CRC_CHECK;
    }
    if (g_req_resp_flags[req->respType] & FSL_SDHC_REQ_RSPTYPE_CHK_IDX)
    {
        flags |= SDHC_HAL_ENABLE_INDEX_CHECK;
    }

    while(SDHC_HAL_IsCmdInhibit(g_sdhcBaseAddr[instance])) {}

    if (req->cmdIndex == kStopTransmission)
    {
        flags |= SDHC_HAL_CMD_TYPE_ABORT;
    }
    else if ((req->data) ||
            (g_req_resp_flags[req->respType] & FSL_SDHC_REQ_RSPTYPE_BUSY))
    {
        while(SDHC_HAL_IsDataInhibit(g_sdhcBaseAddr[instance])) {}
    }

    if (req->data)
    {
        if (req->data->blockCount > 1)
        {
            flags |= SDHC_HAL_MULTIPLE_BLOCK;
            flags |= SDHC_HAL_ENABLE_BLOCK_COUNT;
#ifdef BSP_FSL_SDHC_ENABLE_AUTOCMD12
            /* Enable Auto CMD12 */
            flags |= SDHC_HAL_ENABLE_AUTO_CMD12;
#endif
        }
        if (req->data->blockCount == ((uint32_t) -1))
        {
            SDHC_HAL_SetBlockSize(g_sdhcBaseAddr[instance], req->data->blockSize);
            SDHC_HAL_SetBlockCount(g_sdhcBaseAddr[instance], SDHC_HAL_MAX_BLOCK_COUNT);
            flags &= ~SDHC_HAL_ENABLE_BLOCK_COUNT;
        }
        else
        {
            SDHC_HAL_SetBlockSize(g_sdhcBaseAddr[instance], req->data->blockSize);
            SDHC_HAL_SetBlockCount(g_sdhcBaseAddr[instance], req->data->blockCount);
        }
    }
    else
    {
        SDHC_HAL_SetBlockSize(g_sdhcBaseAddr[instance], 0);
        SDHC_HAL_SetBlockCount(g_sdhcBaseAddr[instance], 0);
    }

    SDHC_HAL_SetCmdArgument(g_sdhcBaseAddr[instance], req->argument);
    SDHC_HAL_SendCmd(g_sdhcBaseAddr[instance], req->cmdIndex, flags);
    return ret;
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDHC_DRV_SetRequestError
 * Description: Set error flags for a given request according to irq flags
 *
 *END*********************************************************************/
static void SDHC_DRV_SetRequestError(sdhc_request_t *req, uint32_t irqFlags)
{
    assert(req);
    if ((!irqFlags) || (!(irqFlags & SDHC_HAL_ALL_ERR_INT)))
    {
        return;
    }

    if (irqFlags & SDHC_HAL_CMD_CRC_ERR_INT)
    {
        req->error |= FSL_SDHC_REQ_ERR_CMD_CRC;
    }
    if (irqFlags & SDHC_HAL_CMD_INDEX_ERR_INT)
    {
        req->error |= FSL_SDHC_REQ_ERR_CMD_INDEX;
    }
    if (irqFlags & SDHC_HAL_CMD_END_BIT_ERR_INT)
    {
        req->error |= FSL_SDHC_REQ_ERR_CMD_END_BIT;
    }
    if (irqFlags & SDHC_HAL_CMD_TIMEOUT_ERR_INT)
    {
        req->error |= FSL_SDHC_REQ_ERR_CMD_TIMEOUT;
    }
    if (irqFlags & SDHC_HAL_DATA_TIMEOUT_ERR_INT)
    {
        req->error |= FSL_SDHC_REQ_ERR_DAT_TIMEOUT;
    }
    if (irqFlags & SDHC_HAL_DATA_CRC_ERR_INT)
    {
        req->error |= FSL_SDHC_REQ_ERR_DATA_CRC;
    }
    if (irqFlags & SDHC_HAL_DATA_END_BIT_ERR_INT)
    {
        req->error |= FSL_SDHC_REQ_ERR_DATA_END_BIT;
    }
    if (irqFlags & SDHC_HAL_AUTO_CMD12_ERR_INT)
    {
        req->error |= FSL_SDHC_REQ_ERR_AUTO_CMD12;
    }
    if (irqFlags & SDHC_HAL_DMA_ERR_INT)
    {
        req->error |= FSL_SDHC_REQ_ERR_DMA;
    }
}

#if ! defined BSP_FSL_SDHC_USING_IRQ
/*FUNCTION****************************************************************
 *
 * Function Name: SDHC_DRV_WaitInt
 * Description: Wait for specific interrupts
 *
 *END*********************************************************************/
static sdhc_status_t SDHC_DRV_WaitInt(uint32_t instance,
                                      uint32_t mask,
                                      uint32_t *irq,
                                      uint32_t timeoutInMs)
{
    uint32_t status = 0;
    semaphore_t timeout;

