jamesmunns/kinetis-rs/platform/drivers/sdhc/src/fsl_sdhc_driver.c
    if (kStatus_OSA_Success != OSA_SemaCreate(&timeout, 0))
    {
        return kStatus_SDHC_Failed;
    }

    do
    {
        *irq = (SDHC_HAL_GetIntFlags(g_sdhcBaseAddr[instance]) & mask);
        if (!timeoutInMs)
        {
            status = OSA_SemaWait(&timeout, OSA_WAIT_FOREVER);
        }
        else
        {
            status = OSA_SemaWait(&timeout, timeoutInMs);
        }
    }
    while ((!(*irq)) && (status == kStatus_OSA_Idle));

    if (status == kStatus_OSA_Idle)
    {
        return kStatus_SDHC_NoError;
    }

    return kStatus_SDHC_TimeoutError;
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDHC_DRV_TransferDataPio
 * Description: transfer data using PIO mode
 *
 *END*********************************************************************/
static sdhc_status_t SDHC_DRV_TransferDataPio(uint32_t instance,
                                              sdhc_request_t *req,
                                              uint32_t timeoutInMs)
{
    uint32_t opMask, mask, i, j, irqFlags, status;
#if defined BSP_FSL_SDHC_SUPPORT_UNALIGNED_BLOCKSIZE_ACCESS
    uint8_t bytesLeft, *byteTmp;
    uint32_t temp;
#endif
    volatile sdhc_host_t *host;
    assert(instance < HW_SDHC_INSTANCE_COUNT);
    assert(req);

    host = g_hosts[instance];
    mask = SDHC_HAL_DATA_COMPLETE_INT | SDHC_HAL_DATA_ERR_INT;
    if ((req->flags & FSL_SDHC_REQ_FLAGS_DATA_READ))
    {
        opMask = SDHC_HAL_BUF_READ_READY_INT;
    }
    else
    {
        opMask = SDHC_HAL_BUF_WRITE_READY_INT;
    }
    for (i = 0; i < req->data->blockCount; i++)
    {
        for (j = 0; j < req->data->blockSize >> 2; j++)
        {
            status = SDHC_DRV_WaitInt(instance, mask | opMask,
                                     &irqFlags, timeoutInMs);
            if (status != kStatus_SDHC_NoError)
            {
                req->error |= FSL_SDHC_REQ_ERR_TIMEOUT;
                host->currentReq = 0;
                SDHC_DRV_SetClock(instance, false);
                SDHC_DRV_SetRequestError(req, irqFlags);
                return kStatus_SDHC_Failed;
            }
            if (irqFlags & SDHC_HAL_DATA_ERR_INT)
            {
                SDHC_HAL_ClearIntFlags(g_sdhcBaseAddr[instance], mask);
                host->currentReq = 0;
                SDHC_DRV_SetClock(instance, false);
                SDHC_DRV_SetRequestError(req, irqFlags);
                return kStatus_SDHC_Failed;
            }
            if (irqFlags & opMask)
            {
                if ((req->flags & FSL_SDHC_REQ_FLAGS_DATA_READ))
                {
                    req->data->buffer[(i * (req->data->blockSize >> 2)) + j]
                        = SDHC_HAL_GetData(g_sdhcBaseAddr[instance]);
                }
                else
                {
                    SDHC_HAL_SetData(g_sdhcBaseAddr[instance],
                        req->data->buffer[(i * (req->data->blockSize >> 2)) + j]);
                }
                SDHC_HAL_ClearIntFlags(g_sdhcBaseAddr[instance], opMask);
            }
            req->data->bytesTransferred += 4;
        }

#if defined BSP_FSL_SDHC_SUPPORT_UNALIGNED_BLOCKSIZE_ACCESS
        bytesLeft = req->data->blockSize % 4;
        if (!bytesLeft)
        {
            continue;
        }

        status = SDHC_DRV_WaitInt(instance, mask | opMask,
                                 &irqFlags, timeoutInMs);
        if (status != kStatus_SDHC_NoError)
        {
            req->error |= FSL_SDHC_REQ_ERR_TIMEOUT;
            host->currentReq = 0;
            SDHC_DRV_SetClock(instance, false);
            SDHC_DRV_SetRequestError(req, irqFlags);
            return kStatus_SDHC_Failed;
        }
        if (irqFlags & SDHC_HAL_DATA_ERR_INT)
        {
            SDHC_HAL_ClearIntFlags(g_sdhcBaseAddr[instance], mask);
            host->currentReq = 0;
            SDHC_DRV_SetClock(instance, false);
            SDHC_DRV_SetRequestError(req, irqFlags);
            return kStatus_SDHC_Failed;
        }
        if (irqFlags & opMask)
        {
            byteTmp = (uint8_t *)req->data->buffer;
            if ((req->flags & FSL_SDHC_REQ_FLAGS_DATA_READ))
            {
                temp = SDHC_HAL_GetData(g_sdhcBaseAddr[instance]);
                while(bytesLeft--)
                {
                    byteTmp[i * req->data->blockSize - bytesLeft] = temp & 0xFF;
                    temp >>= 8;
                }
            }
            else
            {
                while(bytesLeft--)
                {
                    temp |= ((uint32_t)byteTmp[i * req->data->blockSize - bytesLeft] << ((3 - bytesLeft) * 8));
                }
                SDHC_HAL_SetData(g_sdhcBaseAddr[instance], temp);
            }
            req->data->bytesTransferred++;
            SDHC_HAL_ClearIntFlags(g_sdhcBaseAddr[instance], opMask);
        }
#endif
    }

    do
    {
        status = SDHC_DRV_WaitInt(instance, mask, &irqFlags, timeoutInMs);
        if (status != kStatus_SDHC_NoError)
        {
            req->error |= FSL_SDHC_REQ_ERR_TIMEOUT;
            host->currentReq = 0;
            SDHC_DRV_SetClock(instance, false);
            SDHC_DRV_SetRequestError(req, irqFlags);
            return kStatus_SDHC_Failed;
        }
    } while (!(irqFlags & SDHC_HAL_DATA_COMPLETE_INT));

    SDHC_HAL_ClearIntFlags(g_sdhcBaseAddr[instance], mask);
    return kStatus_SDHC_NoError;
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDHC_DRV_TransferDataDma
 * Description: transfer data using DMA mode
 *
 *END*********************************************************************/
static sdhc_status_t SDHC_DRV_TransferDataDma(uint32_t instance,
                                              sdhc_request_t *req,
                                              uint32_t timeoutInMs)
{
    uint32_t mask, irqFlags;
    sdhc_status_t status;
    assert(instance < HW_SDHC_INSTANCE_COUNT);
    assert(req);
    volatile sdhc_host_t *host;

    host = g_hosts[instance];
    if (host->mode == kSdhcTransModeSdma)
    {
        return kStatus_SDHC_NotSupportYet;
    }

    mask = SDHC_HAL_DATA_COMPLETE_INT | SDHC_HAL_DMA_ERR_INT;
    do
    {
        status = SDHC_DRV_WaitInt(instance, mask, &irqFlags, timeoutInMs);
        if (status != kStatus_SDHC_NoError)
        {
            req->error |= FSL_SDHC_REQ_ERR_TIMEOUT;
            host->currentReq = 0;
            SDHC_DRV_SetClock(instance, false);
            SDHC_DRV_SetRequestError(req, irqFlags);
            return kStatus_SDHC_Failed;
        }

        if (irqFlags & SDHC_HAL_DMA_ERR_INT)
        {
            req->error |= FSL_SDHC_REQ_ERR_DMA;
            host->currentReq = 0;
            SDHC_DRV_SetClock(instance, false);
            SDHC_DRV_SetRequestError(req, irqFlags);
            return kStatus_SDHC_Failed;
        }
    } while (!(irqFlags & SDHC_HAL_DATA_COMPLETE_INT));

    SDHC_HAL_ClearIntFlags(g_sdhcBaseAddr[instance], mask);
    return kStatus_SDHC_NoError;
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDHC_DRV_TransferData
 * Description: transfer data using different mode according to the flags
 * of host controller
 *
 *END*********************************************************************/
static sdhc_status_t SDHC_DRV_TransferData(uint32_t instance,
                                           sdhc_request_t *req,
                                           uint32_t timeoutInMs)
{
    assert(instance < HW_SDHC_INSTANCE_COUNT);
    assert(req);

    if (req->flags & FSL_SDHC_REQ_FLAGS_USE_DMA)
    {
        return SDHC_DRV_TransferDataDma(instance, req, timeoutInMs);
    }
    else
    {
        return SDHC_DRV_TransferDataPio(instance, req, timeoutInMs);
    }
}

#else /* BSP_FSL_SDHC_USING_IRQ */

/*FUNCTION****************************************************************
 *
 * Function Name: SDHC_DRV_ClearSetInt
 * Description: Clear then set corresponding interrupt mask
 *
 *END*********************************************************************/
static void SDHC_DRV_ClearSetInt(uint32_t instance,
                                 uint32_t clear,
                                 uint32_t set)
{
    SDHC_HAL_SetIntState(g_sdhcBaseAddr[instance], false, clear);
    SDHC_HAL_SetIntSignal(g_sdhcBaseAddr[instance], false, clear);

    SDHC_HAL_SetIntState(g_sdhcBaseAddr[instance], true, set);
    SDHC_HAL_SetIntSignal(g_sdhcBaseAddr[instance], true, set);
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDHC_DRV_DataIrq
 * Description: handle data related irqs
 *
 *END*********************************************************************/
static void SDHC_DRV_DataIrq(uint32_t instance, uint32_t irq)
{
    sdhc_request_t *req;
    assert(irq & SDHC_HAL_DATA_ALL_INT);

    req = g_hosts[instance]->currentReq;
    assert(req);
    assert(req->data);
    assert(req->data->buffer);

    if (irq & (SDHC_HAL_DATA_ERR_INT | SDHC_HAL_DMA_ERR_INT))
    {
        SDHC_DRV_SetRequestError(req, irq);
        OSA_SemaPost(req->complete);
        return;
    }

    if (irq & SDHC_HAL_BUF_READ_READY_INT)
    {
        req->data->buffer[req->data->bytesTransferred >> 2] =
            SDHC_HAL_GetData(g_sdhcBaseAddr[instance]);
        req->data->bytesTransferred += 4;
    }
    else if (irq & SDHC_HAL_BUF_WRITE_READY_INT)
    {
        SDHC_HAL_SetData(g_sdhcBaseAddr[instance],
                        req->data->buffer[req->data->bytesTransferred >> 2]);
        req->data->bytesTransferred += 4;
    }
    else if (irq & SDHC_HAL_DATA_COMPLETE_INT)
    {
        OSA_SemaPost(req->complete);
    }
    else if (irq & SDHC_HAL_DMA_INT)
    {
        if (g_hosts[instance]->mode != kSdhcTransModeSdma)
        {
            return;
        }
    }
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDHC_DRV_CmdIrq
 * Description: handle command related irqs
 *
 *END*********************************************************************/
static void SDHC_DRV_CmdIrq(uint32_t instance, uint32_t irq)
{
    sdhc_request_t *req;
    uint32_t i;
    assert(instance < HW_SDHC_INSTANCE_COUNT);
    assert(irq & SDHC_HAL_CMD_ALL_INT);
    req = g_hosts[instance]->currentReq;
    if (irq & SDHC_HAL_CMD_ERR_INT)
    {
        SDHC_DRV_SetRequestError(req, irq);
    }
    else if (irq & SDHC_HAL_CMD_COMPLETE_INT)
    {
        if (g_req_resp_flags[req->respType] & FSL_SDHC_REQ_RSPTYPE_PRESENT)
        {
            req->response[0] = SDHC_HAL_GetResponse(g_sdhcBaseAddr[instance], 0);
            if (!(g_req_resp_flags[req->respType] &
                        FSL_SDHC_REQ_RSPTYPE_136BITS))
            {
                if ((req->respType == kSdhcRespTypeR1) ||
                        (req->respType == kSdhcRespTypeR1b))
                {
                    req->cardErrStatus = SDMMC_R1_ERROR_BITS(req->response[0]);
                }
            }
            else
            {
                req->response[1] = SDHC_HAL_GetResponse(g_sdhcBaseAddr[instance], 1);
                req->response[2] = SDHC_HAL_GetResponse(g_sdhcBaseAddr[instance], 2);
                req->response[3] = SDHC_HAL_GetResponse(g_sdhcBaseAddr[instance], 3);
                i = 4;
                do {
                    req->response[i - 1] <<= 8;
                    if (i > 1)
                    {
                        req->response[i - 1] |=
                            ((req->response[i-2] & 0xFF000000U) >> 24);
                    }
                } while(i--);
            }
        }
    }
    if ((!req->data) || (req->cardErrStatus))
    {
        OSA_SemaPost(req->complete);
    }
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDHC_DRV_CardDetectIrq
 * Description: Card detection interrupt handler
 *
 *END*********************************************************************/
static void SDHC_DRV_CardDetectIrq(uint32_t instance, uint32_t irq)
{
    assert(irq & SDHC_HAL_CD_ALL_INT);
    assert(g_hosts[instance]->cardDetectCallback);

    if ((irq & SDHC_HAL_CD_ALL_INT) == SDHC_HAL_CARD_INSERTION_INT)
    {
        if (g_hosts[instance]->cardDetectCallback)
        {
            g_hosts[instance]->cardDetectCallback(true);
        }
        SDHC_DRV_ClearSetInt(instance,
                             SDHC_HAL_CARD_INSERTION_INT,
                             SDHC_HAL_CARD_REMOVAL_INT);
    }
    else
    {
        if (g_hosts[instance]->cardDetectCallback)
        {
            g_hosts[instance]->cardDetectCallback(false);
        }
        SDHC_DRV_ClearSetInt(instance,
                             SDHC_HAL_CARD_REMOVAL_INT,
                             SDHC_HAL_CARD_INSERTION_INT);
    }
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDHC_DRV_BlockGapIrq
 * Description: Block gap interrupt handler
 *
 *END*********************************************************************/
static void SDHC_DRV_BlockGapIrq(uint32_t instance)
{
    assert(g_hosts[instance]->blockGapCallback);
    g_hosts[instance]->blockGapCallback();
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDHC_DRV_CardIntIrq
 * Description: Card interrupt handler
 *
 *END*********************************************************************/
static void SDHC_DRV_CardIntIrq(uint32_t instance)
{
    assert(g_hosts[instance]->cardIntCallback);
    g_hosts[instance]->cardIntCallback();
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDHC_DRV_DoIrq
 * Description: IRQ handler
 *
 *END*********************************************************************/
void SDHC_DRV_DoIrq(uint32_t instance)
{
    volatile uint32_t irq;
    volatile uint32_t cardInt = 0;
    irq = SDHC_HAL_GetIntFlags(g_sdhcBaseAddr[instance]);

    if (!irq)
    {
        return;
    }

    if (irq & SDHC_HAL_CD_ALL_INT)
    {
        SDHC_DRV_CardDetectIrq(instance, (irq & SDHC_HAL_CD_ALL_INT));
    }
    if (irq & SDHC_HAL_CMD_ALL_INT)
    {
        SDHC_DRV_CmdIrq(instance, (irq & SDHC_HAL_CMD_ALL_INT));
    }
    if (irq & SDHC_HAL_DATA_ALL_INT)
    {
        SDHC_DRV_DataIrq(instance, (irq & SDHC_HAL_DATA_ALL_INT));
    }
    if (irq & SDHC_HAL_CARD_INT)
    {
        cardInt = 1;
    }
    if (irq & SDHC_HAL_BLOCK_GAP_EVENT_INT)
    {
        SDHC_DRV_BlockGapIrq(instance);
    }

