jamesmunns/kinetis-rs/platform/drivers/sdhc/src/fsl_sdhc_driver.c
    SDHC_HAL_ClearIntFlags(g_sdhcBaseAddr[instance], irq);

    if (cardInt)
    {
        SDHC_DRV_CardIntIrq(instance);
    }
    return;
}
#endif

/*FUNCTION****************************************************************
 *
 * Function Name: SDHC_DRV_Init
 * Description: Initialize host controller by specific instance index.
 *
 *END*********************************************************************/
sdhc_status_t SDHC_DRV_Init(uint32_t instance,
                            sdhc_host_t *host,
                            const sdhc_user_config_t *config)
{
    uint32_t irqEnabled;

    assert(instance < HW_SDHC_INSTANCE_COUNT);
    assert(host);
    assert(config);

    if (g_hosts[instance])
    {
        return kStatus_SDHC_HostIsAlreadyInited;
    }

    memset(host, 0, sizeof(sdhc_host_t));
    g_hosts[instance] = host;
    host->instance = instance;

#if ! defined BSP_FSL_SDHC_USING_IRQ
    if (config->cdType == kSdhcCardDetectDat3)
    {
        return kStatus_SDHC_HostNotSupport;
    }
#endif

#if ! defined BSP_FSL_SDHC_ENABLE_ADMA1
    if (config->transMode == kSdhcTransModeAdma1)
    {
        return kStatus_SDHC_HostNotSupport;
    }
#endif

    host->cdType = config->cdType;
    if (((host->cdType == kSdhcCardDetectCdPin) ||
         (host->cdType == kSdhcCardDetectDat3)) &&
         (config->cardDetectCallback))
    {
        host->cardDetectCallback = config->cardDetectCallback;
    }

    CLOCK_SYS_EnableSdhcClock(instance);
    SDHC_DRV_SetClock(instance, false);

    /* set clock source for SDHC as kClockPllfllSel */
    CLOCK_SYS_SetSource(kClockSdhcSrc, 1);
    SDHC_DRV_SelectClock(instance);

    SDHC_DRV_SetClock(instance, true);

    SDHC_HAL_Init(g_sdhcBaseAddr[instance]);
    SDHC_DRV_Reset(instance, SDHC_RESET_ALL);
    SDHC_HAL_SetExternalDmaRequest(g_sdhcBaseAddr[instance], false);

    host->maxBlockSize = SDHC_DRV_GetMaxBlockSize(instance);
    if (!host->maxBlockSize)
    {
        CLOCK_SYS_DisableSdhcClock(instance);
        return kStatus_SDHC_Failed;
    }
    host->maxBlockCount = SDHC_HAL_MAX_BLOCK_COUNT;

    host->ocrSupported = 0;
    if (SDHC_HAL_DoesHostSupportV330(g_sdhcBaseAddr[instance]))
    {
        host->ocrSupported |= SD_OCR_VDD_32_33 | SD_OCR_VDD_33_34;
    }
    if (SDHC_HAL_DoesHostSupportV300(g_sdhcBaseAddr[instance]))
    {
        host->ocrSupported |= SD_OCR_VDD_29_30;
    }
    if (SDHC_HAL_DoesHostSupportHighspeed(g_sdhcBaseAddr[instance]))
    {
        host->caps |= FSL_SDHC_HOST_CAPS_SUPPORT_HIGHSPEED;
    }
    if (SDHC_HAL_DoesHostSupportDma(g_sdhcBaseAddr[instance]))
    {
        host->caps |= FSL_SDHC_HOST_CAPS_SUPPORT_DMA;
    }
    if (SDHC_HAL_DoesHostSupportAdma(g_sdhcBaseAddr[instance]))
    {
        host->caps |= FSL_SDHC_HOST_CAPS_SUPPORT_ADMA;
    }
    if (SDHC_HAL_DoesHostSupportSuspendResume(g_sdhcBaseAddr[instance]))
    {
        host->caps |= FSL_SDHC_HOST_CAPS_SUPPORT_SRS;
    }
    if (SDHC_HAL_DoesHostSupportV180(g_sdhcBaseAddr[instance]))
    {
        host->caps |= FSL_SDHC_HOST_CAPS_SUPPORT_V180;
    }

    if (((config->transMode == kSdhcTransModeSdma)
                && (!(host->caps & FSL_SDHC_HOST_CAPS_SUPPORT_DMA)))
            || (((config->transMode == kSdhcTransModeAdma1) ||
                    (config->transMode == kSdhcTransModeAdma2))
                && (!(host->caps & FSL_SDHC_HOST_CAPS_SUPPORT_ADMA)))
            || (host->swFeature & FSL_SDHC_HOST_SW_FEATURE_NODMA))
    {
        CLOCK_SYS_DisableSdhcClock(instance);
        return kStatus_SDHC_HostNotSupport;
    }
    host->mode = config->transMode;

    /* enable irqs */
    SDHC_HAL_SetIntState(g_sdhcBaseAddr[instance], false, SDHC_INT_ALL_MASK);
    SDHC_HAL_SetIntSignal(g_sdhcBaseAddr[instance], false, SDHC_INT_ALL_MASK);
    irqEnabled = SDHC_HAL_CMD_INDEX_ERR_INT | SDHC_HAL_CMD_CRC_ERR_INT |
                 SDHC_HAL_CMD_END_BIT_ERR_INT | SDHC_HAL_CMD_TIMEOUT_ERR_INT |
                 SDHC_HAL_DATA_TIMEOUT_ERR_INT | SDHC_HAL_DATA_CRC_ERR_INT |
                 SDHC_HAL_DATA_END_BIT_ERR_INT | SDHC_HAL_CMD_COMPLETE_INT |
                 SDHC_HAL_DATA_COMPLETE_INT;
#if defined BSP_FSL_SDHC_ENABLE_AUTOCMD12
    irqEnabled |= SDHC_HAL_AUTO_CMD12_ERR_INT;
#endif
    if ((host->cdType == kSdhcCardDetectCdPin) ||
            (host->cdType == kSdhcCardDetectDat3))
    {
        irqEnabled |= (SDHC_HAL_CARD_INSERTION_INT |
                       SDHC_HAL_CARD_REMOVAL_INT);
    }
    if ((host->cdType == kSdhcCardDetectDat3) ||
            (host->cdType == kSdhcCardDetectPollDat3))
    {
        SDHC_HAL_SetD3cd(g_sdhcBaseAddr[instance], true);
        if (kStatus_SDHC_NoMedium == SDHC_DRV_DetectCard(instance))
        {
            irqEnabled &= ~SDHC_HAL_CARD_REMOVAL_INT;
        }
        else
        {
            irqEnabled &= ~SDHC_HAL_CARD_INSERTION_INT;
        }
    }

    if (host->mode == kSdhcTransModeAdma2)
    {
        SDHC_HAL_SetDmaMode(g_sdhcBaseAddr[instance], kSdhcHalDmaAdma2);
    }
#if defined BSP_FSL_SDHC_ENABLE_ADMA1
    else if (host->mode == kSdhcTransModeAdma1)
    {
        SDHC_HAL_SetDmaMode(g_sdhcBaseAddr[instance], kSdhcHalDmaAdma1);
    }
#endif
    else
    {
        SDHC_HAL_SetDmaMode(g_sdhcBaseAddr[instance], kSdhcHalDmaSimple);
    }

    SDHC_HAL_SetIntState(g_sdhcBaseAddr[instance], true, irqEnabled);
    if ((host->cdType == kSdhcCardDetectPollDat3) ||
         (host->cdType == kSdhcCardDetectPollCd))
    {
        irqEnabled &= ~(SDHC_HAL_CARD_REMOVAL_INT |
                SDHC_HAL_CARD_INSERTION_INT);
    }
    SDHC_HAL_SetIntSignal(g_sdhcBaseAddr[instance], true, irqEnabled);

#if defined BSP_FSL_SDHC_USING_BIG_ENDIAN
    host->endian = kSdhcHalEndianBig;
#else
    host->endian = kSdhcHalEndianLittle;
#endif

    SDHC_HAL_SetEndian(g_sdhcBaseAddr[instance], host->endian);

    SDHC_HAL_SetWriteWatermarkLevel(g_sdhcBaseAddr[instance], 1);
    SDHC_HAL_SetReadWatermarkLevel(g_sdhcBaseAddr[instance], 1);

