jamesmunns/kinetis-rs/platform/drivers/sdhc/src/fsl_sdhc_driver.c
    SDHC_DRV_SetBusWidth(instance, kSdhcBusWidth1Bit);
    SDHC_DRV_ConfigClock(instance, config->clock);

#if defined BSP_FSL_SDHC_USING_IRQ
    if (config->cardIntCallback)
    {
        host->cardIntCallback = config->cardIntCallback;
    }
    if (config->blockGapCallback)
    {
        host->blockGapCallback = config->blockGapCallback;
    }
    INT_SYS_EnableIRQ(g_sdhcIrqId[instance]);
#endif
    return kStatus_SDHC_NoError;
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDHC_DRV_Shutdown
 * Description: Deinitialize host controller
 *
 *END*********************************************************************/
void SDHC_DRV_Shutdown(uint32_t instance)
{
    if (g_hosts[instance] == 0)
    {
        return;
    }

#if defined BSP_FSL_SDHC_USING_IRQ
    INT_SYS_DisableIRQ(g_sdhcIrqId[instance]);
#endif

    if (g_hosts[instance]->admaTableAddress != NULL)
    {
        OSA_MemFree(g_hosts[instance]->admaTableAddress);
        g_hosts[instance]->admaTableAddress = NULL;
        g_hosts[instance]->admaTableMaxEntries = 0;
    }
    SDHC_HAL_SetSdClock(g_sdhcBaseAddr[instance], false);
    SDHC_DRV_SetClock(instance, false);
    CLOCK_SYS_DisableSdhcClock(instance);
    g_hosts[instance] = 0;
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDHC_DRV_DetectCard
 * Description: check whether the card is present on specified host
 *      controller.
 *
 *END*********************************************************************/
sdhc_status_t SDHC_DRV_DetectCard(uint32_t instance)
{
    assert(instance < HW_SDHC_INSTANCE_COUNT);
    volatile sdhc_host_t *host = g_hosts[instance];
    if (host->cdType == kSdhcCardDetectGpio)
    {
        return kStatus_SDHC_UnknownStatus;
    }

    SDHC_DRV_SetClock(instance, true);
    if (!SDHC_DRV_IsCardPresent(instance))
    {
        host->flags &= (uint32_t)(~FSL_SDHC_HOST_FLAGS_CARD_PRESENTED);
        SDHC_DRV_SetClock(instance, false);
        return kStatus_SDHC_NoMedium;
    }
    host->flags |= FSL_SDHC_HOST_FLAGS_CARD_PRESENTED;
    SDHC_HAL_InitCard(g_sdhcBaseAddr[instance], 100);
    SDHC_DRV_SetClock(instance, false);
    return kStatus_SDHC_NoError;
}

/*FUNCTION****************************************************************
 *
 * Function Name: SDHC_DRV_IssueRequestBlocking
 * Description: Isuue request on specific host controller and return
 *      on completion.
 *
 *END*********************************************************************/
sdhc_status_t SDHC_DRV_IssueRequestBlocking(uint32_t instance,
                                            sdhc_request_t *req,
                                            uint32_t timeoutInMs)
{
    sdhc_status_t ret;
    volatile sdhc_host_t *host;

    assert(instance < HW_SDHC_INSTANCE_COUNT);
    assert(req);

    host = g_hosts[instance];
    ret = kStatus_SDHC_NoError;
    req->error = 0;
#if ! defined BSP_FSL_SDHC_SUPPORT_UNALIGNED_BLOCKSIZE_ACCESS
    if ((req->data) && (req->data->blockSize % 4))
    {
        return kStatus_SDHC_BlockSizeNotSupportError;
    }
#endif

    if ((req->data) && (host->mode != kSdhcTransModePio))
    {
        if (kStatus_SDHC_NoError == SDHC_DRV_PrepareData(instance, req))
        {
            req->flags |= FSL_SDHC_REQ_FLAGS_USE_DMA;
        }
    }

#if defined BSP_FSL_SDHC_USING_IRQ
    osa_status_t status;
    semaphore_t *complete =
        (semaphore_t *)OSA_MemAllocZero(sizeof(semaphore_t));
    if (kStatus_OSA_Success != OSA_SemaCreate(complete, 0))
    {
        return kStatus_SDHC_Failed;
    }
    assert(!req->complete);         /* it should not be asigned outside of this routine */
    req->complete = complete;
#endif

    SDHC_DRV_SetClock(instance, true);

    if (host->currentReq)
    {
        req->error |= FSL_SDHC_REQ_ERR_HOST_BUSY;
        SDHC_DRV_SetClock(instance, false);
#if defined BSP_FSL_SDHC_USING_IRQ
        OSA_SemaDestroy(req->complete);
        OSA_MemFree(req->complete);
        req->complete = NULL;
#endif
        return kStatus_SDHC_HostIsBusyError;
    }

    host->currentReq = req;

    if (kStatus_SDHC_NoError != SDHC_DRV_SendCommand(instance, req))
    {
        host->currentReq = 0;
        SDHC_DRV_SetClock(instance, false);
        req->error |= FSL_SDHC_REQ_ERR_SEND_CMD;
#if defined BSP_FSL_SDHC_USING_IRQ
        OSA_SemaDestroy(req->complete);
        OSA_MemFree(req->complete);
        req->complete = NULL;
#endif
        return kStatus_SDHC_Failed;
    }

#if defined BSP_FSL_SDHC_USING_IRQ
    do
    {
        if (!timeoutInMs)
        {
            status = OSA_SemaWait(req->complete, OSA_WAIT_FOREVER);
        }
        else
        {
            status = OSA_SemaWait(req->complete, timeoutInMs);
        }
    } while (status == kStatus_OSA_Idle);

    if (status != kStatus_OSA_Success)
    {
        req->error |= FSL_SDHC_REQ_ERR_TIMEOUT;
    }

    OSA_SemaDestroy(req->complete);
    OSA_MemFree(req->complete);
    req->complete = NULL;
#else
    uint32_t mask = 0, irqFlags = 0, i;
    mask = SDHC_HAL_CMD_COMPLETE_INT | SDHC_HAL_CMD_ERR_INT;
    if (kStatus_SDHC_NoError != SDHC_DRV_WaitInt(instance, mask, &irqFlags, timeoutInMs))
    {
        host->currentReq = 0;
        SDHC_DRV_SetClock(instance, false);
        SDHC_DRV_SetRequestError(req, irqFlags);
        return kStatus_SDHC_Failed;
    }

    if (irqFlags != SDHC_HAL_CMD_COMPLETE_INT)
    {
        SDHC_HAL_ClearIntFlags(g_sdhcBaseAddr[instance], mask);
        host->currentReq = 0;
        SDHC_DRV_SetClock(instance, false);
        SDHC_DRV_SetRequestError(req, irqFlags);
        return kStatus_SDHC_Failed;
    }

    SDHC_HAL_ClearIntFlags(g_sdhcBaseAddr[instance], SDHC_HAL_CMD_COMPLETE_INT);
    if (g_req_resp_flags[req->respType] & FSL_SDHC_REQ_RSPTYPE_PRESENT)
    {
        req->response[0] = SDHC_HAL_GetResponse(g_sdhcBaseAddr[instance], 0);
        if (!(g_req_resp_flags[req->respType] & FSL_SDHC_REQ_RSPTYPE_136BITS))
        {
            if ((req->respType == kSdhcRespTypeR1) ||
                    (req->respType == kSdhcRespTypeR1b))
            {
                req->cardErrStatus = SDMMC_R1_ERROR_BITS(req->response[0]);
            }
        }
        else
        {
            req->response[1] = SDHC_HAL_GetResponse(g_sdhcBaseAddr[instance], 1);
            req->response[2] = SDHC_HAL_GetResponse(g_sdhcBaseAddr[instance], 2);
            req->response[3] = SDHC_HAL_GetResponse(g_sdhcBaseAddr[instance], 3);
            i = 4;
            do {
                req->response[i - 1] <<= 8;
                if (i > 1)
                {
                    req->response[i - 1] |=
                        ((req->response[i-2] & 0xFF000000U) >> 24);
                }
            } while(i--);
        }
    }

    if ((!req->cardErrStatus) && (req->data))
    {
        ret = SDHC_DRV_TransferData(instance, req, timeoutInMs);
    }
#endif

    if (req->cardErrStatus)
    {
        ret = kStatus_SDHC_RequestCardStatusError;
    }

    if (req->error)
    {
        ret = kStatus_SDHC_RequestFailed;
    }

    host->currentReq = 0;
    SDHC_DRV_SetClock(instance, false);
    return ret;
}

/*************************************************************************************************
 * EOF
 ************************************************************************************************/

